README.md
```mermaid
classDiagram
    class Car {
        -carId : String
        -carname : String
        -cartype : CarType
        -cs : CarStatus
        -lc : String
        -bprice : double
        +setprice(days) : double
    }

    class CarFactory {
        +createcar()
    }

    class Customer {
        -name : String
        -id : String
        -license : String
    }

    class Reservation {
        -id : String
        -customer : Customer
        -car : Car
        -startDate : LocalDate
        -endDate : LocalDate
        -status : ReservationStatus
    }

    class ReservationManager {
        -reservations : Map
        +createReservation()
        +cancelReservation()
        +modifyReservation()
    }

    class CarRentalSystem {
        -instance : CarRentalSystem
        -allCars : Map
        -reservations : Map
        -carFactory : CarFactory
        -pay : Payment
        +getInstance()
        +createCar()
        +searchCar()
        +createReservation()
        +cancelReservation()
        +totalPrice()
        +processPayment()
    }

    class Payment {
        <<interface>>
    }

    class CreditPayment {
    }

    Car <|-- LuxuryCar
    Car <|-- NormalCar
    CarRentalSystem --> CarFactory
    CarRentalSystem --> Car
    CarRentalSystem --> ReservationManager
    CarRentalSystem --> Payment
    Reservation --> Customer
    Reservation --> Car
    Payment <|.. CreditPayment
```
